Revit 2024 API
ColorFillLegend.GetColumnWidths Method
 Returns array of column widths in the legend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public IList<double> GetColumnWidths()
Visual Basic
Public Function GetColumnWidths As IList(Of Double)
Visual C++
public:
IList<double>^ GetColumnWidths()
See Also
ColorFillLegend Class
Autodesk.Revit.DB Namespace